app/Controllers/OfficeController.php

    public function show($id = null)
    {
        $office = new \App\Models\Office();
        $data = $office->find($id);
---
SELECT *
FROM `offices`
WHERE `offices`.`id` = '1'

    public function getall()
    {
        $request = service('request');
        $postData = $request->getPost();

        $response = array();

        ## Read value
        $draw = $postData['draw'];
        $start = $postData['start'];
        $rowperpage = $postData['length']; // Rows display per page
        $searchValue = $postData['search']['value']; // Search value
        $sortby = $postData['order'][0]['column']; // Sort column index
        $sortdir = $postData['order'][0]['dir']; // Sort direction
        $sortcolumn = $postData['columns'][$sortby]['data']; // Sort column name

        ## Total number of records without filtering
        $office = new \App\Models\Office();
        $totalRecords = $office->select('id')->countAllResults();

        ## Total number of records with filtering
        $totalRecordwithFilter = $office->select('id')
            ->orLike('office_name', $searchValue)
            ->orLike('description', $searchValue)
            ->countAllResults();

        ## Fetch records
        $records = $office->select('*')
            ->orLike('office_name', $searchValue)
            ->orLike('description', $searchValue)
            ->orderBy($sortcolumn, $sortdir)
            ->findAll($rowperpage, $start);
---
SELECT COUNT(*) AS `numrows`
FROM `offices`
SELECT COUNT(*) AS `numrows`
FROM `offices`
WHERE `office_name` LIKE '%%' ESCAPE '!'
OR  `description` LIKE '%%' ESCAPE '!'
SELECT *
FROM `offices`
WHERE `office_name` LIKE '%%' ESCAPE '!'
OR  `description` LIKE '%%' ESCAPE '!'
ORDER BY `id` ASC
 LIMIT 5