app/Controllers/TicketController.php

SELECT *
FROM `offices`
---
    public function index()
    {
        $office = new \App\Models\Office();
        $data['offices'] = $office->findAll();

SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '1'
---
    public function show($id = null)
    {
        $ticket = new \App\Models\Ticket();
        $data = $ticket->find($id);

SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `user_id` = 2
SELECT COUNT(*) AS `numrows`
FROM `tickets`
JOIN `offices` ON `offices`.`id` = `tickets`.`office_id`
WHERE `tickets`.`user_id` = 2
SELECT `tickets`.*, `offices`.`office_name`
FROM `tickets`
JOIN `offices` ON `offices`.`id` = `tickets`.`office_id`
WHERE `tickets`.`user_id` = 2
 LIMIT 3
---
    public function getall()
    {
        $request = service('request');
        $postData = $request->getPost();

        $user = auth()->user()->id;
        if (auth()->user()->inGroup('user')) {
            $response = array();

            ## Read value
            $draw = $postData['draw'];
            $start = $postData['start'];
            $rowperpage = $postData['length']; // Rows display per page
            $searchValue = $postData['search']['value']; // Search value

            ## Total number of records without filtering
            $ticket = new \App\Models\Ticket();
            $totalRecords = $ticket->select('id')->where('user_id',$user)->countAllResults();

            ## Total number of records with filtering
            $totalRecordwithFilter = $ticket->select('tickets.*, offices.office_name')
                ->join('offices', 'offices.id = tickets.office_id')
                ->where('tickets.user_id',$user)
                ->countAllResults();

            ## Fetch records
            $records = $ticket->select("tickets.*, offices.office_name")
                ->join('offices', 'offices.id = tickets.office_id')
                ->where('tickets.user_id',$user)
                ->findAll($totalRecords, $start);